name: "whisper_template"
backend: "python"
max_batch_size: 0

input [
  {
    name: "AUDIO_DATA"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "LANGUAGE"
    data_type: TYPE_STRING
    dims: [ 1 ]
    optional: true
  }
]

output [
  {
    name: "TRANSCRIPT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
    gpus: [ 0 ]
  }
]
